In [1]:
!pip install sqlalchemy psycopg2 pandas

Requirement already satisfied: sqlalchemy in c:\users\arkat\anaconda3\lib\site-packages (2.0.39)
Collecting psycopg2
  Downloading psycopg2-2.9.11-cp313-cp313-win_amd64.whl.metadata (5.1 kB)
Requirement already satisfied: pandas in c:\users\arkat\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\arkat\anaconda3\lib\site-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\arkat\anaconda3\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\arkat\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\arkat\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\arkat\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\arkat\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\arkat\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading psycopg2-2.9.11-cp313-cp313-win_amd64.whl (2.7 MB)
   ---------------------------------------- 0.0/2.7 MB ? eta -:--:--
   ---------------------------------------- 2.7/2.7 MB 16.9 MB/s eta 0:00:00
Installing collected packages: psycopg2
Successfully installed psycopg2-2.9.11

In [ ]:
# 1. Conexión a PostgreSQL y carga de tablas

In [2]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine('postgresql://postgres:kari@localhost:5432/classicmodels')

def leer_tabla(tabla, engine):
    return pd.read_sql_table(tabla, con=engine)

orders = leer_tabla('orders', engine)
orderdetails = leer_tabla('orderdetails', engine)
customers = leer_tabla('customers', engine)
products = leer_tabla('products', engine)
employees = leer_tabla('employees', engine)

orders.head(1)

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363

In [ ]:
# 2. Cruce de tablas con integridad referencial

In [3]:
ventas = pd.merge(orderdetails, orders, on='orderNumber', validate='many_to_one')
ventas = pd.merge(ventas, customers, on='customerNumber', validate='many_to_one')
ventas = pd.merge(ventas, products, on='productCode', validate='many_to_one')

ventas[['orderNumber', 'customerName', 'productName']].head(3)

,orderNumber,customerName,productName
0,10100,Online Diecast Creations Co.,1917 Grand Touring Sedan
1,10100,Online Diecast Creations Co.,1911 Ford Town Car
2,10100,Online Diecast Creations Co.,1932 Alfa Romeo 8C2300 Spider Sport

In [ ]:
# 3. Agregar columnas: venta, costo y ganancia

In [4]:
ventas['venta'] = ventas['quantityOrdered'] * ventas['priceEach']
ventas['costo'] = ventas['quantityOrdered'] * ventas['buyPrice']
ventas['ganancia'] = ventas['venta'] - ventas['costo']

ventas[['productName', 'venta', 'costo', 'ganancia']].head(3)

                           productName    venta    costo  ganancia
0             1917 Grand Touring Sedan  4080.00  2601.00    1479.0
1                   1911 Ford Town Car  2754.50  1665.00    1089.5
2  1932 Alfa Romeo 8C2300 Spider Sport  1660.12   951.72     708.4

In [ ]:
# 4. Total por línea de producto + fila TOTAL

In [5]:
ventas_por_linea = ventas.groupby('productLine')[['venta', 'costo', 'ganancia']].sum()
ventas_por_linea.loc['TOTAL'] = ventas_por_linea.sum()
ventas_por_linea

                       venta       costo    ganancia
productLine
Classic Cars      3853922.49  2327710.29  1526212.20
Motorcycles       1121426.12   652170.82   469255.30
Planes             954637.54   588676.83   365960.71
Ships              663998.34   402708.87   261289.47
Trains             188532.92   123191.90    65341.02
Trucks and Buses  1024113.57   623560.35   400553.22
Vintage Cars      1797559.63  1060291.30   737268.33
TOTAL             9604190.61  5778310.36  3825880.25

In [ ]:
# 5. ¿Cuántos clientes hicieron compras?

In [6]:
clientes_con_compras = ventas['customerNumber'].nunique()
print("Clientes que hicieron compras:", clientes_con_compras)

Clientes que hicieron compras: 98

In [ ]:
# 6. ¿Cuántos clientes no han comprado?

In [7]:
clientes_todos = set(customers['customerNumber'])
clientes_con_orden = set(orders['customerNumber'])
clientes_sin_compras = clientes_todos - clientes_con_orden

print("Clientes sin compras:", len(clientes_sin_compras))

Clientes sin compras: 24

In [ ]:
# 7. Filtrar ventas del año 2005

In [8]:
ventas['orderDate'] = pd.to_datetime(ventas['orderDate'])
ventas_2005 = ventas[(ventas['orderDate'] >= '2005-01-01') & (ventas['orderDate'] <= '2005-12-31')]

ventas_2005[['orderDate', 'customerName', 'productName', 'venta']].head(3)

,orderDate,customerName,productName,venta
2473,2005-01-05,Technics Stores Inc.,2003 Harley-Davidson Eagle Drag Bike,4004.88
2474,2005-01-05,Technics Stores Inc.,2002 Suzuki XREO,2882.88
2475,2005-01-05,Technics Stores Inc.,1936 Harley Davidson El Knucklehead,1239.93

In [ ]:
# 8. Top 10 clientes por ventas en 2005

In [9]:
top_clientes_2005 = ventas_2005.groupby('customerName')[['venta', 'costo', 'ganancia']].sum()
top_clientes_2005 = top_clientes_2005.sort_values(by='venta', ascending=False).head(10).reset_index()
top_clientes_2005

                   customerName      venta      costo   ganancia
0        Euro+ Shopping Channel  290018.52  169989.97  120028.55
1  Mini Gifts Distributors Ltd.  192481.73  115084.72   77397.01
2             La Rochelle Gifts   91147.11   55527.04   35620.07
3     The Sharp Gifts Warehouse   83984.89   50843.02   33141.87
4    Down Under Souveniers, Inc   75020.13   46389.52   28630.61
5       Anna's Decorations, Ltd   56932.30   35414.90   21517.40
6         Salzburg Collectables   52420.07   33536.26   18883.81
7             Gifts4AllAges.com   50806.85   33221.25   17585.60
8      Corporate Gift Ideas Co.   46781.66   28561.31   18220.35
9       Oulu Toy Supplies, Inc.   46770.52   27493.61   19276.91

In [ ]:
# 9. Top 10 productos más vendidos en 2005

In [11]:
top_productos_2005 = ventas_2005.groupby('productName')[['venta', 'costo', 'ganancia']].sum()
top_productos_2005 = top_productos_2005.sort_values(by='venta', ascending=False).head(10).reset_index()
top_productos_2005

                            productName     venta     costo  ganancia
0           1992 Ferrari 360 Spider red  52978.28  27031.30  25946.98
1  2003 Harley-Davidson Eagle Drag Bike  34856.12  19023.18  15832.94
2              1952 Alpine Renault 1300  34037.20  17152.92  16884.28
3                     1968 Ford Mustang  31699.51  17161.20  14538.31
4               1956 Porsche 356A Coupe  31432.14  25066.50   6365.64
5                      2002 Suzuki XREO  30434.09  15308.37  15125.72
6                    1969 Dodge Charger  29567.27  15974.56  13592.71
7                     1997 BMW R 1100 S  28747.69  16493.06  12254.63
8              1917 Grand Touring Sedan  27830.70  16386.30  11444.40
9                   1972 Alfa Romeo GTA  27225.84  18678.24   8547.60

In [ ]:
# 10. Guardar ambos reportes en PostgreSQL

In [12]:
top_clientes_2005.to_sql('top_10_clientes_2005', con=engine, if_exists='replace', index=False)
top_productos_2005.to_sql('top_10_productos_2005', con=engine, if_exists='replace', index=False)

10

In [ ]:
# 11. Aplicación del principio DRY con funciones

In [13]:
def filtrar_por_fecha(df, columna_fecha, inicio, fin):
    df[columna_fecha] = pd.to_datetime(df[columna_fecha])
    return df[(df[columna_fecha] >= inicio) & (df[columna_fecha] <= fin)]

def generar_reporte(df, columna_agrupadora):
    resumen = df.groupby(columna_agrupadora)[['venta', 'costo', 'ganancia']].sum()
    resumen.loc['TOTAL'] = resumen.sum()
    return resumen

def top_n(df, columna_agrupadora, n=10):
    resumen = df.groupby(columna_agrupadora)[['venta', 'costo', 'ganancia']].sum()
    return resumen.sort_values(by='venta', ascending=False).head(n).reset_index()

def guardar_en_postgres(df, nombre_tabla, engine, if_exists='replace'):
    df.to_sql(nombre_tabla, con=engine, if_exists=if_exists, index=False)